
IDENTIFICATION DIVISION. 
PROGRAM-ID. Ceaser. 

ENVIRONMENT DIVISION. 

DATA DIVISION.

WORKING-STORAGE SECTION.
	01 default PIC A(26) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ". 
    01 place PIC 9 VALUE 5. 
PROCEDURE DIVISION. 
    DISPLAY default 
    DISPLAY place 
    STOP RUN. 
END PROGRAM Ceaser.